Config/DataProcessors/ПечатьЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПечатьЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШтрихкода</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПодключаемогоОборудования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяФискализация</Name>
					<Comment>Автоматическая фискализация чеков из очереди чеков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяФН36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОтраслевыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользовательБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ПечатьЭтикеток/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьЭтикеток") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПечатьЭтикеток", "Этикетки", СформироватьТабличныйДокумент(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТабличныйДокумент(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	Если ПараметрыПечати = Неопределено Или Не ПараметрыПечати.Свойство("АдресТаблицыВХранилище") Тогда
		ВызватьИсключение "Неправильный вызов процедуры печати";
	КонецЕсли;
	
	ТаблицаОбъектов = ПолучитьИзВременногоХранилища(ПараметрыПечати.АдресТаблицыВХранилище);
	
	ПечататьТекст			= ?(ПараметрыПечати.Свойство("ПечататьТекст")	, ПараметрыПечати["ПечататьТекст"]						, Ложь);
	РазмерШрифта			= ?(ПараметрыПечати.Свойство("РазмерШрифта")	, ПараметрыПечати["РазмерШрифта"]						, 0);
	УголПоворота			= ?(ПараметрыПечати.Свойство("УголПоворота")	, ПараметрыПечати["УголПоворота"]						, 0);
	Выравнивание			= ?(ПараметрыПечати.Свойство("Выравнивание")	, ПараметрыПечати["Выравнивание"]						, 1);
	ПечатьНаПринтерЭтикеток	= ?(ПараметрыПечати.Свойство("ФорматБумаги")	, ЗначениеЗаполнено(ПараметрыПечати["ФорматБумаги"])	, Ложь);
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОбъектов.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаОбъектов.ОсновноеСредство КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ТаблицаОбъектов.ИнвентарныйНомер КАК Справочник.ИнвентарныеНомераОС) КАК ИнвентарныйНомер,
	|	ТаблицаОбъектов.ТипШтрихкода КАК ТипШтрихкода,
	|	ТаблицаОбъектов.Штрихкод КАК Штрихкод,
	|	ТаблицаОбъектов.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаОбъектов
	|ИЗ
	|	&ТаблицаОбъектов КАК ТаблицаОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаОбъектов.ОсновноеСредство.Организация.НаименованиеПолное = """"
	|			ТОГДА ТаблицаОбъектов.ОсновноеСредство.Организация.Наименование
	|		ИНАЧЕ ТаблицаОбъектов.ОсновноеСредство.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаОбъектов.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ТаблицаОбъектов.ОсновноеСредство.Наименование
	|		ИНАЧЕ ТаблицаОбъектов.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК ОсновноеСредство,
	|	ТаблицаОбъектов.ОсновноеСредство.НоменклатурныйНомер КАК НоменклатурныйНомер,
	|	ТаблицаОбъектов.ОсновноеСредство.Код КАК Код,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаОбъектов.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ТаблицаОбъектов.ТипШтрихкода КАК ТипШтрихкода,
	|	ТаблицаОбъектов.Штрихкод КАК Штрихкод,
	|	ТаблицаОбъектов.Количество КАК Количество
	|ИЗ
	|	ТаблицаОбъектов КАК ТаблицаОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОбъектов.НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьЭтикеток.ПФ_MXL_Этикетка");
	Область = Макет.ПолучитьОбласть("Горизонтальная|Вертикальная");
	Рисунок = Область.Рисунки.Штрихкод;
	
	Эталон = Справочники.ПодключаемоеОборудование.ПолучитьМакет("МакетДляОпределенияКоэффициентовЕдиницИзмерения");
	КоличествоМиллиметровВПикселеВысота = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	КоличествоМиллиметровВПикселеШирина = Эталон.Рисунки.Квадрат100Пикселей.Ширина / 100;
	ШиринаШтрихкода = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселеШирина);
	ВысотаШтрихкода = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселеВысота);
	
	Если ПечатьНаПринтерЭтикеток Тогда
		КоличествоПоШирине = 1;
		КоличествоПоВысоте = 1;
	Иначе
		КоличествоПоШирине = 0;
		КоличествоПоВысоте = 0;
	КонецЕсли;
	
	ТекущееКоличествоПоШирине = 0;
	ТекущееКоличествоПоВысоте = 0;
	
	НоваяСтрока = Истина;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Если ПечатьНаПринтерЭтикеток Тогда
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетка_ПринтерЭтикеток";
	Иначе
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетка";
	КонецЕсли;
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина					= ШиринаШтрихкода;
	ПараметрыШтрихкода.Высота					= ВысотаШтрихкода;
	ПараметрыШтрихкода.ОтображатьТекст			= ПечататьТекст;
	ПараметрыШтрихкода.РазмерШрифта				= РазмерШрифта;
	ПараметрыШтрихкода.УголПоворота				= УголПоворота;
	ПараметрыШтрихкода.ВертикальноеВыравнивание	= Выравнивание;
	ПараметрыШтрихкода.Масштабировать			= Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		Область.Параметры.Заполнить(Выборка);
		
		ПараметрыШтрихкода.Штрихкод = Выборка.Штрихкод;
		ПараметрыШтрихкода.ТипКода = КонвертироватьТипШтрихкода(Выборка.ТипШтрихкода);
		ДанныеИзображения = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
		Область.Рисунки.Штрихкод.Картинка = ?(ДанныеИзображения.Результат, ДанныеИзображения.Картинка, Новый Картинка);
		
		Для Счетчик = 1 По Выборка.Количество Цикл
			
			Если Не НоваяСтрока Тогда
				
				Если КоличествоПоШирине = 0 Тогда
					Если Не ТабличныйДокумент.ПроверитьПрисоединение(Область) Тогда
						КоличествоПоШирине = ТекущееКоличествоПоШирине;
					КонецЕсли;
				КонецЕсли;
				
				Если ТекущееКоличествоПоШирине = КоличествоПоШирине И ТекущееКоличествоПоШирине <> 0 Тогда
					ТекущееКоличествоПоШирине = 0;
					НоваяСтрока = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НоваяСтрока Тогда
				
				Если КоличествоПоВысоте = 0 Тогда
					Если Не ТабличныйДокумент.ПроверитьВывод(Область) Тогда
						КоличествоПоВысоте = ТекущееКоличествоПоВысоте;
					КонецЕсли;
				КонецЕсли;
				
				Если ТекущееКоличествоПоВысоте = КоличествоПоВысоте И ТекущееКоличествоПоВысоте <> 0 Тогда
					Если Не ПечатьНаПринтерЭтикеток Тогда
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					ТекущееКоличествоПоВысоте = 0;
					ТекущееКоличествоПоШирине = 0;
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(Область);
				ТекущееКоличествоПоВысоте = ТекущееКоличествоПоВысоте + 1;
				ТекущееКоличествоПоШирине = ТекущееКоличествоПоШирине + 1;
				НоваяСтрока = Ложь;
				
			Иначе
				
				ТабличныйДокумент.Присоединить(Область);
				ТекущееКоличествоПоШирине = ТекущееКоличествоПоШирине + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция КонвертироватьТипШтрихкода(ТипШтрихкода)
	
	Если ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
		Результат = 0;
	ИначеЕсли ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
		Результат = 1;
	ИначеЕсли ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128 Тогда
		Результат = 2;
	ИначеЕсли ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code39 Тогда
		Результат = 3;
	ИначеЕсли ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128 Тогда
		Результат = 4;
	ИначеЕсли ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.ITF14 Тогда
		Результат = 11;
	ИначеЕсли ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.QR Тогда
		Результат = 16;
	Иначе
		Результат = 99;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
